ext-sources-app/tests/test_files/soap/CHI_testSearchByCity_PaginatedAndSorted_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.services.screening.medicaid.gov/">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:searchByCity>
         <arg0>
            <city>HILLSBORO</city>
            <pageSize>2</pageSize>
            <pageNumber>2</pageNumber>
            <sortColumn>firstName</sortColumn>
         </arg0>
      </impl:searchByCity>
   </soapenv:Body>
</soapenv:Envelope>